leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.FTM.h
/*
 * S32K1xx.FTM.h
 *
 *  Created on: 2020年7月20日
 *      Author: Master.HE
 */

#ifndef S32K1XX_FTM_H_
#define S32K1XX_FTM_H_

#include "S32K1xx.Type.h"


typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PS								:3;
		__IO uint32_t CLKS								:2;
		__IO uint32_t CPWMS								:1;
		__IO uint32_t RIE								:1;
		__IO uint32_t RF								:1;

		__IO uint32_t TOIE								:1;
		__IO uint32_t TOF								:1;
		__IO uint32_t									:6;

		__IO uint32_t PWMENn							:8;

		__IO uint32_t FLTPS								:4;
		__IO uint32_t									:4;
	}BIT;
}FTM_SC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t COUNT								:16;
		__IO uint32_t									:16;
	}BIT;
}FTM_CNT_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t MOD								:16;
		__IO uint32_t									:16;
	}BIT;
}FTM_MOD_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DMA								:1;
		__IO uint32_t ICRST								:1;
		__IO uint32_t ELSB_ELSA							:2;
		//__IO uint32_t ELSA							:1;
		//__IO uint32_t ELSB							:1;
		__IO uint32_t MSB_MSA							:2;
		//__IO uint32_t MSA								:1;
		//__IO uint32_t MSB								:1;
		__IO uint32_t CHIE								:1;
		__IO uint32_t CHF								:1;

		__IO uint32_t TRIGMODE							:1;
		__IO uint32_t CHIS								:1;
		__IO uint32_t CHOV								:1;
		__IO uint32_t									:21;
	}BIT;
}FTM_CnSC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t VAL								:16;
		__IO uint32_t									:16;
	}BIT;
}FTM_CnV_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t INIT								:16;
		__IO uint32_t									:16;
	}BIT;
}FTM_CNTIN_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CHnF								:8;
		__IO uint32_t									:24;
	}BIT;
}FTM_STATUS_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FTMEN								:1;
		__IO uint32_t INIT								:1;
		__IO uint32_t WPDIS								:1;
		__IO uint32_t PWMSYNC							:1;
		__IO uint32_t CAPTEST							:1;
		__IO uint32_t FAULTM							:2;
		__IO uint32_t FAULTIE							:1;

		__IO uint32_t									:24;
	}BIT;
}FTM_MODE_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CNTMIN							:1;
		__IO uint32_t CNTMAX							:1;
		__IO uint32_t REINIT							:1;
		__IO uint32_t SYNCHOM							:1;
		__IO uint32_t TRIG0								:1;
		__IO uint32_t TRIG1								:1;
		__IO uint32_t TRIG2								:1;
		__IO uint32_t SWSYNC							:1;

		__IO uint32_t									:24;
	}BIT;
}FTM_SYNC_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CHnOI								:8;
		__IO uint32_t									:24;
	}BIT;
}FTM_OUTINIT_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CHnOM								:8;
		__IO uint32_t									:24;
	}BIT;
}FTM_OUTMASK_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint8_t COMBINE							:1;
		__IO uint8_t COMP								:1;
		__IO uint8_t DECAPEN							:1;
		__IO uint8_t DECAP								:1;
		__IO uint8_t DTEN								:1;
		__IO uint8_t SYNCEN								:1;
		__IO uint8_t FAULTEN							:1;
		__IO uint8_t MCOMBINE							:1;
	}BIT[4];
}FTM_COMBINE_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DTVAL								:6;
		__IO uint32_t DTPS								:2;

		__IO uint32_t									:8;

		__IO uint32_t DTVALEX							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}FTM_DEADTIME_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CH2TRIG							:1;
		__IO uint32_t CH3TRIG							:1;
		__IO uint32_t CH4TRIG							:1;
		__IO uint32_t CH5TRIG							:1;
		__IO uint32_t CH0TRIG							:1;
		__IO uint32_t CH1TRIG							:1;
		__IO uint32_t INITTRIGEN						:1;
		__IO uint32_t TRIGF								:1;

		__IO uint32_t CH6TRIG							:1;
		__IO uint32_t CH7TRIG							:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}FTM_EXTTRIG_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t POLn								:8;
		__IO uint32_t									:24;
	}BIT;
}FTM_POL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FAULTF0							:1;
		__IO uint32_t FAULTF1							:1;
		__IO uint32_t FAULTF2							:1;
		__IO uint32_t FAULTF3							:1;
		__IO uint32_t									:1;
		__IO uint32_t FAULTIN							:1;
		__IO uint32_t WPEN								:1;
		__IO uint32_t FAULTF							:1;

		__IO uint32_t									:24;
	}BIT;
}FTM_FMS_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CH0FVAL							:4;
		__IO uint32_t CH1FVAL							:4;
		__IO uint32_t CH2FVAL							:4;
		__IO uint32_t CH3FVAL							:4;

		__IO uint32_t									:16;
	}BIT;
}FTM_FILTER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FAULT0EN							:1;
		__IO uint32_t FAULT1EN							:1;
		__IO uint32_t FAULT2EN							:1;
		__IO uint32_t FAULT3EN							:1;
		__IO uint32_t FFLTR0EN							:1;
		__IO uint32_t FFLTR1EN							:1;
		__IO uint32_t FFLTR2EN							:1;
		__IO uint32_t FFLTR3EN							:1;

		__IO uint32_t FFVAL								:4;
		__IO uint32_t									:3;
		__IO uint32_t FSTATE							:1;

		__IO uint32_t									:16;
	}BIT;
}FTM_FLTCTRL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t QUADEN							:1;
		__IO uint32_t TOFDIR							:1;
		__IO uint32_t QUADIR							:1;
		__IO uint32_t QUADMODE							:1;
		__IO uint32_t PHBPOL							:1;
		__IO uint32_t PHAPOL							:1;
		__IO uint32_t PHBFLTREN							:1;
		__IO uint32_t PHAFLTREN							:1;

		__IO uint32_t									:24;
	}BIT;
}FTM_QDCTRL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t LDFQ								:5;
		__IO uint32_t									:1;
		__IO uint32_t BDMMODE							:2;

		__IO uint32_t									:1;
		__IO uint32_t GTBEEN							:1;
		__IO uint32_t GTBEOUT							:1;
		__IO uint32_t ITRIGR							:1;
		__IO uint32_t									:4;

