leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.FTM.h
		__IO uint32_t									:16;
	}BIT;
}FTM_CONF_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FLTnPOL							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:24;
	}BIT;
}FTM_FLTPOL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t HWTRIGMODE						:1;
		__IO uint32_t									:1;
		__IO uint32_t CNTINC							:1;
		__IO uint32_t									:1;
		__IO uint32_t INVC								:1;
		__IO uint32_t SWOC								:1;
		__IO uint32_t									:1;
		__IO uint32_t SYNCMODE							:1;

		__IO uint32_t SWRSTCNT							:1;
		__IO uint32_t SWWRBUF							:1;
		__IO uint32_t SWOM								:1;
		__IO uint32_t SWINVC							:1;
		__IO uint32_t SWSOC								:1;
		__IO uint32_t									:3;

		__IO uint32_t HWRSTCNT							:1;
		__IO uint32_t HWWRBUF							:1;
		__IO uint32_t HWOM								:1;
		__IO uint32_t HWINVC							:1;
		__IO uint32_t HWSOC								:1;
		__IO uint32_t									:3;

		__IO uint32_t									:8;
	}BIT;
}FTM_SYNCONF_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t INVnEN							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:24;
	}BIT;
}FTM_INVCTRL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CHnOC								:8;
		__IO uint32_t CHnOCV							:8;
		__IO uint32_t									:16;
	}BIT;
}FTM_SWOCTRL_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CHnSEL							:8;

		__IO uint32_t HCSEL								:1;
		__IO uint32_t LDOK								:1;
		__IO uint32_t GLEN								:1;
		__IO uint32_t GLDOK								:1;
		__IO uint32_t									:4;

		__IO uint32_t									:16;
	}BIT;
}FTM_PWMLOAD_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t HCVAL								:16;
		__IO uint32_t									:16;
	}BIT;
}FTM_HCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DTVAL								:6;
		__IO uint32_t DTPS								:2;

		__IO uint32_t									:8;

		__IO uint32_t DTVALEX							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}FTM_PAIR0DEADTIME_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DTVAL								:6;
		__IO uint32_t DTPS								:2;

		__IO uint32_t									:8;

		__IO uint32_t DTVALEX							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}FTM_PAIR1DEADTIME_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DTVAL								:6;
		__IO uint32_t DTPS								:2;

		__IO uint32_t									:8;

		__IO uint32_t DTVALEX							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}FTM_PAIR2DEADTIME_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DTVAL								:6;
		__IO uint32_t DTPS								:2;

		__IO uint32_t									:8;

		__IO uint32_t DTVALEX							:4;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}FTM_PAIR3DEADTIME_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t									:8;

		__IO uint32_t									:3;
		__IO uint32_t FRACMOD							:5;

		__IO uint32_t MOD								:16;
	}BIT;
}FTM_MOD_MIRROR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t									:8;

		__IO uint32_t									:3;
		__IO uint32_t FRACVAL							:5;

		__IO uint32_t VAL								:16;
	}BIT;
}FTM_CV_MIRROR_Type;
/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */


/** FTM - Size of Registers Arrays */
#define FTM_CONTROLS_COUNT                       8u

#if (defined (__Target_S32K116__) || defined (__Target_S32K118__) || defined (__Target_S32K142__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define FTM_CV_MIRROR_COUNT                      8u
#endif

/** FTM - Register Layout Typedef */
typedef struct {
	FTM_SC_Type SC;                                /**< Status And Control, offset: 0x0 */
	FTM_CNT_Type CNT;                               /**< Counter, offset: 0x4 */
	FTM_MOD_Type MOD;                               /**< Modulo, offset: 0x8 */
	struct {                                         /* offset: 0xC, array step: 0x8 */
		FTM_CnSC_Type CnSC;                              /**< Channel (n) Status And Control, array offset: 0xC, array step: 0x8 */
		FTM_CnV_Type CnV;                               /**< Channel (n) Value, array offset: 0x10, array step: 0x8 */
	} CONTROLS[FTM_CONTROLS_COUNT];
	FTM_CNTIN_Type CNTIN;                             /**< Counter Initial Value, offset: 0x4C */
	FTM_STATUS_Type STATUS;                            /**< Capture And Compare Status, offset: 0x50 */
	FTM_MODE_Type MODE;                              /**< Features Mode Selection, offset: 0x54 */
	FTM_SYNC_Type SYNC;                              /**< Synchronization, offset: 0x58 */
	FTM_OUTINIT_Type OUTINIT;                           /**< Initial State For Channels Output, offset: 0x5C */
	FTM_OUTMASK_Type OUTMASK;                           /**< Output Mask, offset: 0x60 */
	FTM_COMBINE_Type COMBINE;                           /**< Function For Linked Channels, offset: 0x64 */
	FTM_DEADTIME_Type DEADTIME;                          /**< Deadtime Configuration, offset: 0x68 */
	FTM_EXTTRIG_Type EXTTRIG;                           /**< FTM External Trigger, offset: 0x6C */
	FTM_POL_Type POL;                               /**< Channels Polarity, offset: 0x70 */
	FTM_FMS_Type FMS;                               /**< Fault Mode Status, offset: 0x74 */
	FTM_FILTER_Type FILTER;                            /**< Input Capture Filter Control, offset: 0x78 */
	FTM_FLTCTRL_Type FLTCTRL;                           /**< Fault Control, offset: 0x7C */
	FTM_QDCTRL_Type QDCTRL;                            /**< Quadrature Decoder Control And Status, offset: 0x80 */
	FTM_CONF_Type CONF;                              /**< Configuration, offset: 0x84 */
	FTM_FLTPOL_Type FLTPOL;                            /**< FTM Fault Input Polarity, offset: 0x88 */
	FTM_SYNCONF_Type SYNCONF;                           /**< Synchronization Configuration, offset: 0x8C */
	FTM_INVCTRL_Type INVCTRL;                           /**< FTM Inverting Control, offset: 0x90 */
	FTM_SWOCTRL_Type SWOCTRL;                           /**< FTM Software Output Control, offset: 0x94 */
	FTM_PWMLOAD_Type PWMLOAD;                           /**< FTM PWM Load, offset: 0x98 */
	FTM_HCR_Type HCR;                               /**< Half Cycle Register, offset: 0x9C */
	FTM_PAIR0DEADTIME_Type PAIR0DEADTIME;                     /**< Pair 0 Deadtime Configuration, offset: 0xA0 */
	uint8_t RESERVED_0[4];
	FTM_PAIR1DEADTIME_Type PAIR1DEADTIME;                     /**< Pair 1 Deadtime Configuration, offset: 0xA8 */
	uint8_t RESERVED_1[4];
	FTM_PAIR2DEADTIME_Type PAIR2DEADTIME;                     /**< Pair 2 Deadtime Configuration, offset: 0xB0 */
	uint8_t RESERVED_2[4];
	FTM_PAIR3DEADTIME_Type PAIR3DEADTIME;                     /**< Pair 3 Deadtime Configuration, offset: 0xB8 */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__) || defined (__Target_S32K142__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	uint8_t RESERVED_3[324];
	FTM_MOD_MIRROR_Type MOD_MIRROR;                        /**< Mirror of Modulo Value, offset: 0x200 */
	FTM_CV_MIRROR_Type CV_MIRROR[FTM_CV_MIRROR_COUNT];    /**< Mirror of Channel (n) Match Value, array offset: 0x204, array step: 0x4 */
#endif
} FTM_Type, *FTM_MemMapPtr;

 /** Number of instances of the FTM module. */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define FTM_INSTANCE_COUNT                       (2u)
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__))
#define FTM_INSTANCE_COUNT                       (4u)
#elif (defined (__Target_S32K146__))
#define FTM_INSTANCE_COUNT                       (6u)
#elif (defined (__Target_S32K148__))
#define FTM_INSTANCE_COUNT                       (8u)
#endif

/* FTM - Peripheral instance base addresses */
/** Peripheral FTM0 base address */
#define FTM0_BASE                                (0x40038000u)
/** Peripheral FTM0 base pointer */
#define FTM0                                     ((FTM_Type *)FTM0_BASE)
/** Peripheral FTM1 base address */
#define FTM1_BASE                                (0x40039000u)
/** Peripheral FTM1 base pointer */
#define FTM1                                     ((FTM_Type *)FTM1_BASE)

